const province = [
    {
        id: 9,
        name: "آذربايجان غربی",
    },
    {
        id: 21,
        name: "آذربایجان شرقی",
    },
    {
        id: 6,
        name: "اردبيل",
    },
    {
        id: 13,
        name: "اصفهان",
    },
    {
        id: 23,
        name: "البرز",
    },
    {
        id: 22,
        name: "ایلام",
    },
    {
        id: 17,
        name: "بوشهر",
    },
    {
        id: 18,
        name: "تهران",
    },
    {
        id: 16,
        name: "چهارمحال و بختياری",
    },
    {
        id: 30,
        name: "خراسان جنوبی",
    },
    {
        id: 7,
        name: "خراسان رضوی",
    },
    {
        id: 29,
        name: "خراسان شمالی",
    },
    {
        id: 5,
        name: "خوزستان",
    },
    {
        id: 12,
        name: "زنجان",
    },
    {
        id: 20,
        name: "سمنان",
    },
    {
        id: 24,
        name: "سیستان و بلوچستان",
    },
    {
        id: 1,
        name: "فارس",
    },
    {
        id: 26,
        name: "قزوین",
    },
    {
        id: 14,
        name: "قم",
    },
    {
        id: 15,
        name: "گلستان",
    },
    {
        id: 19,
        name: "گیلان",
    },
    {
        id: 4,
        name: "لرستان",
    },
    {
        id: 27,
        name: "مازندران",
    },
    {
        id: 28,
        name: "مرکزی",
    },
    {
        id: 3,
        name: "هرمزگان",
    },
    {
        id: 10,
        name: "همدان",
    },
    {
        id: 11,
        name: "کردستان",
    },
    {
        id: 2,
        name: "کرمان",
    },
    {
        id: 8,
        name: "کرمانشاه",
    },
    {
        id: 32,
        name: "کشور",
    },
    {
        id: 25,
        name: "کهگلویه و بویر احمد",
    },
    {
        id: 31,
        name: "یزد",
    }
]

export default province;
