export const IranianEnum = {
    0: 'خارجی',
    1: 'ایرانی',
};


export const apiKeyStatusEnum = {
    1: 'فعال',
    0: 'غیر فعال',
};

export const PlanEnum = {
    1: 'رایگان',
    2: 'نقره ای',
    3: 'طلایی',
};

export const GhasedakConfirmationStatusEnum = {
    0: 'تایید نشده',
    1: 'تایید شده',
    2: 'عدم صحت اطلاعات',
};

export const WebServiceLogStatusEnum = [
    200, 500, 403, 401, 418, 416, 412, 406, 426, 451, 419, 422, 420, 402, 413, 400, 428, 429,
];
export const UserTypeEnum = {
    0: 'حقیقی',
    1: 'حقوقی',
  };
export const UserStatusEnum = {
    1: 'فعال',
    2: 'غیر فعال',
    3: 'بلاک شده',
  };
export const LinkStatusEnum = {
    0: 'در انتظار تایید',
    1: 'تایید شده',
    2: 'تایید نشده',
};

// -----------------------------------------------
export const ActionTypeEnum = {
    '-1': 'همه',
    0: 'get',
    1: 'post',
    2: 'update',
    3: 'delete',
}

export const ProviderNameEnum = {
    100: 'همه',
    0: 'مخابرات',
    1: 'رهیاب',
    2: 'پیامده',
    3: 'مگفا',
    4: 'ارمغان',
    5: 'اسمارت',
    7: 'پردیس',
    8: 'RPG',
    9: 'آتیه',
    20: 'صوتی',
    22: 'کندو',
    23: 'smstalk',
    24: 'تابان',
    25: 'کندو 2000',
    26: 'کندو sms',
    11: 'twilio',
    12: 'سپاهان گستر',
    27: 'آسیاتک',
    28: 'کندو صوتی',
    29: 'سامانتل',
    30: 'BTS',
    31: 'آتیه پروکسی'
}

export const ProviderResponseCodeEnum = {
    0: 'NoError',
    100: 'موفق',
    1: 'خطای نامشخص',
    2: 'درخواست ارسال نشد',
    3: 'مورد نظر یافت نشد referenceId',
    4: 'احراز هویت کاربر موفقیت آمیز نبود',
    5: 'نام کاربری یافت نشد',
    6: 'خط پیدا نشد',
    7: 'اعتبار کم است',
    8: 'فرمت درخواست اشتباه است',
    9: 'شماره گیرنده پیامک اشتباه است',
    10: 'حساب منقضی شده است',
    11: 'آی پی مجاز نیست',
    12: 'شماره گیرنده در بلک لیست قرار دارد.',
    13: 'حساب فعال نیست',
    14: 'خطا در تبدیل مدل دریافتی از سرویس دهنده',
    15: 'سرور مشغول است',
    16: 'تعداد گیرندگان زیاد است',
    17: 'شماره پورت صحیح نیست',
    18: 'به سرویس دسترسی ندارید',
    19: 'خطای نامشخص از سمت سرویس دهنده',
    20: 'محدودیت در ارسال روزانه',
    21: 'خط فعال نیست',
    22: 'پیام حاوی لینک است',
    23: 'سرعت ارسال زیاد است',
    24: 'طول پیام زیاد است',
    25: 'پیام حاوی کلمات غیر مجاز است',
    26: 'شبکه غیرقابل دسترس است',
    27: 'اپراتور معتبر نیست',
    28: 'اپراتور برای این ارسال تعرفه ای ندارد',
    29: 'متن پیام خالیست',
    30: 'متد درخواستی نامعتبر است',
    31: 'پیام ورودی جدید خوانده نشده ای وجود ندارد',
    32: 'طول آرایه ها باهم تطابق ندارد',
    33: 'به خط دسترسی ندارید',
    34: 'شناسه پیام معتبر نیست',
    35: 'تاریخ پیام خارج از محدوده است',
    36: 'ورودی نامعتبر است',
    37: 'تعداد پیامها زیاد است',
    38: 'آرایه طولانی تر از حد مجاز است',
    39: 'پیام جدیدی وجود ندارد',
    40: 'ارور بیربط',
    512: 'خطای سیستمی در ارسال',
    200: '200',
    400: '400',
    401: '401',
    403: '403',
    404: '404',
    405: '405',
    406: '406',
    407: '407',
    408: '408',
    409: '409',
    410: '410',
    411: '411',
    412: '412',
    413: '413',
    414: '414',
    415: '415',
    416: '416',
    417: '417',
    418: '418',
    421: '421',
    422: '422',
    423: '423',
    424: '424',
    425: '425',
    426: '426',
    428: '428',
    429: '429',
    431: '431',
    451: '451',
    500: '500',
    501: '501',
    502: '502',
    503: '503',
    504: '504',
    505: '505',
    506: '506',
    507: '507',
    508: '508',
    510: '510',
    511: '511'
}

export const RoleTypeEnum = {
    1: 'کاربر',
    2: 'ادمین',
}

export const RoleNameEnum = {
    '-1': 'همه',
    0: 'سوپر ادمین',
    1: 'ادمین',
    2: 'کاربر',
    3: 'ساپورت',
    4: 'حسابداری',
    5: 'ویژه',
}

export const SmsStatusReportEnum = {
    '-1': 'بدون وضعیت',
    0: 'به سرویس دهنده فرستاده شده است',
    1: 'به سرویس دهنده رسیده است',
    2: 'در لیست سیاه قرار دارد',
    3: 'به گوشی نرسیده است',
    4: 'به گوشی رسیده است',
    5: 'بلاک شده است',
    6: 'با خطا مواجه شده است',
    7: 'وضعیت دریافت نشد',
    8: 'وضعیت نامشخص است',
    9: 'با خطا مواجه شده است.ارسال نخواهد شد',
}

export const SmsTypeEnum = {
    0: 'تکی از پنل',
    1: 'تکی از وب سرویس',
    2: 'گروهی از پنل',
    3: 'گروهی از وب سرویس',
}

export const TokenTypeEnum = {
    0: 'None',
    1: 'ثبت نام',
    2: 'ورود',
    3: 'تغییر',
    4: 'تغییر موبایل',
}

export const WebServiceErrorEnum = {
    '-1': 'با موفقیت انجام شد',
    0: 'خطایی رخ داده است',
    1: 'کد شناسائی معتبر نمی باشد',
    2: 'حساب کاربری فعال نمی باشد',
    3: 'اعتبار شما کافی نمی‌باشد',
    4: 'حساب کاربری فعال نمی باشد',
    5: 'شناسه IP سرویس مبدا با تنظیمات مطابقت ندارد',
    7: 'امکان دسترسی به خط مورد نظر وجود ندارد',
    8: 'اطلاعات مالکیت خط تائید نشده است',
    9: 'خط مورد نظر غیرفعال است',
    10: 'امکان ارسال با خط عمومی وجود ندارد',
    11: 'استفاده از این متد نیازمند ارتقاء پلن می‌باشد',
    12: 'درخواست تکراری می باشد',
    13: 'اپراتور پیامکی معتبر نمی باشد',
    15: 'پروایدر معتبر نمی باشد',
    16: 'تعرفه ارسال معتبر نمی باشد',
    17: 'پیام به دلیل وجود کاراکتر نامناسب قابل ارسال نیست',
    18: 'استفاده از لینک غیر مجاز در متن پیامک',
    19: 'عملیات ناموفق بود',
    20: 'طول پیام بیشتر از 1000 کاراکتر می باشد',
    21: 'پارامتر های ورودی صحیح نمی باشد',
    22: 'قالب پیام نامعتبر میباشد',
    23: 'پارامتر یافت نشد',
    24: 'تعداد گیرنده های وارد شده بیش از حد مجاز است',
    25: 'گیرنده وارد نشده است',
    26: 'امکان دسترسی به سرویس مورد نظر وجود ندارد',
    27: 'درحال حاضر با این خط تنها امکان ارسال به شماره خود را دارید',
    28: 'خط منقضی شده است',
    29: 'شناسه پیام وارد نشده است',
    30: 'پارامتر یافت نشد',
}

export const OperatorTypeEnum = {
    '-1': 'همه',
    0: 'همراه اول',
    1: 'ایرانسل',
    2: 'رایتل'
}

export const ProviderAccountEnum = {
    1: 'ParsaSms',
    2: 'Farajian',
}

export const GenderEnum = {
    1: 'مرد',
    0: 'زن'
}

export const LineOwnerStatEnum = {
    '-1': 'همه',
    0: 'اطلاعات خالی است',
    10: 'بدون اطلاعات',
    20: 'تکمیل اطلاعات',
    30: 'تایید',
    40: 'تایید مگفا',
    50: 'تایید کد مگفا',
    100: 'رد شده',
}

export const CompanyTypeEnum = {
    1: 'سهامی عام',
    2: 'سهامی خاص',
    3: 'با مسئولیت محدود',
    4: 'تضامنی',
    5: 'مختلط غیر سهامی',
    6: 'مختلط سهامی',
    7: 'نسبی',
    8: 'تعاونی',
    9: 'دولتی',
    10: 'وزارتخانه',
    11: 'سفارتخانه',
    12: 'مسجد',
    13: 'مدرسه',
    14: 'NGO',
}

export const NaturalIdentificationTypeEnum = {
    0: 'کد ملی',
    1: 'گذرنامه',
    2: 'کارت آزمایش',
    3: 'کارت پناهندگی',
    4: 'کارت هویت',
    5: 'شناسه ملي',
    6: 'شماره فراگیر گذرنامه',
}

export const LegalIdentificationType = {
    5: 'شناسه ملي',
    6: 'شماره فراگیر گذرنامه',
}

export const LegalActivityTypeEnum = {
    1: 'بانک و موسسات مالی',
    2: 'موسسات خدماتی',
    3: 'موسسات تولیدی',
    4: 'خدمات بیمه',
    5: 'رسانه و خبر گذاری',
    6: 'تبلیغات',
    7: 'فناوری اطلاعات',
    9: 'سایر',
}

export const LegalTypeEnum = {
    0: 'حقیقی',
    1: 'حقوقی'
}

export const LineStatusEnum = {
    '-1': 'همه',
    0: 'حذف شده',
    1: 'فعال',
    2: 'غیرفعال',
}

export const MessageTypeEnum = {
    0: 'نامشخص',
    1: 'اعلان',
    2: 'ایمیل',
}
export const CategoryEnum = {
    1: 'اطلاعیه',
    2: 'هشدار',
    3: 'خطر'
}
export const MessageStatusEnum = {
    0: 'نامشخص',
    1: 'درانتظار',
    2: 'ارسال شده',
    3: 'دیده شده',
    4: 'خطا',
}

export const BankEnumEnum = {
    '-1': 'همه',
    0: 'زرین پال',
    1: 'ایرانی',
    2: 'ملت',
    3: 'زیبال',
}
export const BankAccountEnumEnum = {
    0: 'غیرفعال',
    1: 'فعال',
    2: 'حذف شده',
}

export const PaymentStatusEnum = {
    '-1': 'همه',
    0: 'پرداخت نشده',
    1: 'پرداخت شده',
}

export const ReceptorStatusEnum = {
    '-1': 'همه',
    1: 'بلاک',
    2: 'در انتظار ارسال',
    3: 'درحال ارسال',
    4: 'ارسال',
    6: 'خطا',
    7: 'لیست سیاه',
    8: 'لیست سیاه داخلی',
}

export const OtpTemplateStatusEnum = {
    '-1': 'همه',
    0: 'در انتظار تایید',
    1: 'تایید شده',
    2: 'رد شده',
}

export const OriginEnum = {
    '-1': 'همه',
    1: 'وب سرویس',
    2: 'اعتبار سنجی',
    3: 'پنل',
    4: 'دیباگ',
    5: 'گروهی وب سرویس',
    6: 'تبریک تولد',
    7: 'هشدار شارژ',
    8: 'هشدار ورود',
    9: 'اطلاع رسانی',
    10: 'ورود دو مرحله ای',
    11: 'انقصا پلن',
    12: 'اعلان اختلال',
    14: 'ثبت نام',
    15: 'فراموشی رمز',
    16: 'تغییر شماره کاربر',
}

export const TransactionTypeEnum = {
    0: 'None',
    1: 'افزایش اعتبار',
    2: 'خرید پلن',
    3: 'خرید خط',
    4: 'برگشت هزینه',
    5: 'لغو پیام تکی',
    6: 'لغو پیام گروهی',
    7: 'لغو پیام گروهی وب سرویس',
    8: 'افزایش اعتبار ادمین',
    9: 'کاهش اعتبار ادمین',
    10: 'برگشت هزینه ادمین',

}

export const CreditTypeEnum = {
    0: 'همه',
    1: 'شارژ حساب',
    2: 'پیام اعتبار سنجی',
    3: 'پیام تکی',
    4: 'پیام گروهی',
    5: 'پیام تکی وب سرویس',
    6: 'پیام گروهی وب سرویس',
    7: 'خرید پلن از شارژ',
    8: 'خرید خط از شارژ',
    9: 'برگشت هزینه'
}

export const SmsStatusEnum = {
    '-1': 'همه',
    0: 'درانتظار تایید',
    1: 'رد شده',
    2: 'درانتظار ارسال',
    3: 'در حال ارسال',
    4: 'ارسال شده',
    5: 'دیباگ',
    6: 'خطا درارسال',
    7: 'لغو شده',
    8: 'لیست سیاه',
    9: 'توقف',
    10: 'پردازش',
}
export const RejectionReasonEnum = {
    1: 'کلمات غیرمجاز',
    2: 'لینک',
    3: 'خط نیاز به تایید دارد',
    4: 'حداکثر تعداد گیرنده',
}

export const SendStatusEnum = {
    0: 'درانتظار تایید',
    1: 'InternalBlocked',
    2: 'درانتظار ارسال',
    3: 'در حال ارسال',
    4: 'ارسال شده',
    5: 'دیباگ',
    6: 'خطای داخلی',
    7: 'لغو شده',
    8: 'لیست سیاه داخلی',
    9: 'توقف',
    10: 'ارسال به سرویس دهنده',
    11: 'دریافت در سرویس دهنده',
    12: 'لیست سیاه',
    13: 'نرسیده به گوشی',
    14: 'رسیده به گوشی',
    15: 'بلاک',
    16: 'خطا درارسال',
}
export const ProviderEnum = {
    0: 'آسانک (پیش شماره 021)',
    1: 'رهیاب (پیش شماره 1000)',
    2: 'پیامده (GSM Modem)',
    3: 'مگفا (پیش شماره 3000)',
    4: 'ارمغان (پیش شماره 5004)',
    5: 'سرزمین هوشمند (پیش شماره 5002)',
    7: 'پردیس',
    8: 'رهیاب پیام گستر (پیش شماره 5001)',
    9: 'آتیه (پیش شماره 2000)',
    20: 'صوتی',
    11: 'Twilio',
    12: 'SepahanGostar',
    22: 'کندو gsm',
    23: 'smstalk',
    24: 'taban',
    25: 'candoo 2000 (پیش شماره 2000)',
    26: 'کندو sms',
    27: 'آسیاتک (پیش شماره 9000)',
    28: 'کندو صوتی',
    29: 'سامانتل (پیش شماره 9999)',
    30: 'BTS',
    31: 'آتیه پروکسی',
  };
  export const singleSmsStatusEnum = {
    0: 'در انتظار تایید',
    1: 'بلک لیست',
    2: 'در صف ارسال',
    3: 'در حال ارسال',
    4: 'ارسال',
    5: 'حالت دیباگ',
    6: 'خطا در ارسال',
  };
  export const ManualTransactionTypeEnum = {
    8: 'افزایش اعتبار دستی',
    9: 'کاهش اعتبار دستی',
    10: 'برگشت هزینه',
  };
  export const ServiceTypeEnum = {
    1: ' امکان ارسال پیام تکی',
    2: 'امکان ارسال پیام گروهی',
    3: 'امکان ارسال پیام اعتبار سنجی (OTP)',
    4: 'امکان دریافت گزارش وضعیت پیام های ارسالی از طریق وب سرویس',
    5: 'دریافت پیام های ارسال شده به پنل',
    6: 'امکان مشاهده اطلاعات حساب کاربری',
    7: ' امکان ارسال پیام صوتی',
  };
  export const  PanelType=
  {
      1 : "Admin",
      2 : "Parent",
      3 : "User"
  }
  export const  GroupAccessType=
    {
       
        1:" عدم نمایش شماره موبایل مخاطبین",
        2:"عدم امکان ویرایش اطلاعات گروه (فقط خواندنی)",
        3:"دسترسی به صورت کامل",
      
    }
